abstract class AppConstants{
  static const surahNames = ["الفاتحه","البقرة","آل عمران","النساء","المائدة","الأنعام","الأعراف","الأنفال","التوبة","يونس","هود"
    ,"يوسف","الرعد","إبراهيم","الحجر","النحل","الإسراء","الكهف","مريم","طه","الأنبياء","الحج","المؤمنون"
    ,"النّور","الفرقان","الشعراء","النّمل","القصص","العنكبوت","الرّوم","لقمان","السجدة","الأحزاب","سبأ"
    ,"فاطر","يس","الصافات","ص","الزمر","غافر","فصّلت","الشورى","الزخرف","الدّخان","الجاثية","الأحقاف"
    ,"محمد","الفتح","الحجرات","ق","الذاريات","الطور","النجم","القمر","الرحمن","الواقعة","الحديد","المجادلة"
    ,"الحشر","الممتحنة","الصف","الجمعة","المنافقون","التغابن","الطلاق","التحريم","الملك","القلم","الحاقة","المعارج"
    ,"نوح","الجن","المزّمّل","المدّثر","القيامة","الإنسان","المرسلات","النبأ","النازعات","عبس","التكوير","الإنفطار"
    ,"المطفّفين","الإنشقاق","البروج","الطارق","الأعلى","الغاشية","الفجر","البلد","الشمس","الليل","الضحى","الشرح"
    ,"التين","العلق","القدر","البينة","الزلزلة","العاديات","القارعة","التكاثر","العصر",
    "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون","النصر","المسد","الإخلاص","الفلق","الناس"];



  static const hadethNames = ["الحديث الخمسون","الحديث التاسع الاربعون","الحديث الثامن الاربعون","الحديث السابع الاربعون","الحديث السادس الاربعون","الحديث الخامس الاربعون","الحديث الرابع الاربعون","الحديث الثالث الاربعون","الحديث الثاني الاربعون","الحديث الحادي الاربعون"
    ,"الحديث الاربعون", "الحديث التاسع الثلاثون","الحديث الثامن الثلاثون","الحديث السابع الثلاثون","الحديث السادس الثلاثون","الحديث الخامس الثلاثون","الحديث الرابع الثلاثون","الحديث الثالث الثلاثون","الحديث الثاني و الثلاثون","الحديث الحادي الثلاثون"
    ,"الحديث الثلاثون", "الحديث التاسع و العشرون","الحديث الثامن و العشرون","الحديث السابع و العشرون","الحديث السادس و العشرون","الحديث الخامس و العشرون","الحديث الرابع و العشرون","الحديث الثالث و العشرون","الحديث الثاني و العشرون","الحديث الحادي و العشرون"
    ,"الحديث العشرون", "الحديث التاسع عشر","الحديث الثامن عشر","الحديث السابع عشر","الحديث السادس عشر","الحديث الخامس عشر","الحديث الرابع عشر","الحديث الثالث عشر","الحديث الثاني عشر","الحديث الحادي عشر",
    "الحديث العاشر","الحديث التاسع","الحديث الثامن","الحديث السابع","الحديث الثالث","الحديث الخامس","الحديث الرابع"," الحديث الثالث","الحديث الثاني","الحديث الاول"];
}

